          01 WS-EMPLOYEE.
      *****************************************************************
      *       EMPLOYEE KEY
      *****************************************************************
            02 EMP-KEY.
               05 WS-EMP-ID         PIC X(10).
      *****************************************************************
      *       EMPLOYEE DETAILS
      *****************************************************************
            02 EMP-DTL.
               05 EMP-NAME          PIC X(20).
               05 EMP-ADDRESS       PIC X(30).
               05 EMP-ADDRESS2                REDEFINES EMP-ADDRESS.
                  06 WS-EMP-ADDRS   PIC X(30).
               05 EMP-CITY          PIC X(20).
               05 EMP-ST            PIC X(20).
               05 EMP-COUNTRY       PIC X(20).
               05 EMP-ZIP           PIC 9(06) COMP-3.
               05 EMP-DOB           PIC 9(08).
      *****************************************************************
      *      EMPLOYEE POLICY DETAILS
      *****************************************************************
            02 EMP-PLCY-PLAN.
             03 EMP-COVERAGE OCCURS 5 TIMES.
               05 EMP-PLCY          PIC X(06).
               05 EMP-DIV           PIC 9(04) BINARY.
               05 EMP-CLS           PIC 9(04) BINARY.
               05 EMP-ACTIVE-DATE   PIC 9(08) COMP-3.
               05 EMP-CANCEL-DATE   PIC 9(08) COMP-3.
            02 FILLER               PIC X(10).
