      
       01  FIRST-TYPE         REDEFINES   REDEFINES-RECORD.             
         02  REDEFINES-RECORD-KEY.                                      
           04  REDEFINES-RECORD-TYPE       PIC  X(02).                  
           04  SOME-FIELD-NUMBER           PIC  X(07).                  
           04  SOME-FIELD-NUMBER-2         PIC  X(06).                  
           04  SOME-FIELD-NUMBER-3         PIC  9(04).                  
           04  CREATION-DATE  PIC  X(08).                               
      