        01 P3-Emp.
           03 First-name               Pic x(9).
           03 last-name                Pic X(10).
           03 Age                      Pic 9(3).
		   03 Gender                   Pic X(6).
           03 Place                    Pic X(15).